-- 管理员表
INSERT INTO
    Admin
VALUES
    ('000000', 'lxy', '123456'),
    ('000001', 'ty', '654321');

-- 部门表
INSERT INTO
    Department
VALUES
    (0, '研发部'),
    (1, '市场部'),
    (2, '销售部');

-- 岗位表
INSERT INTO
    Post
VALUES
    (0, 0, '安卓'),
    (1, 0, '前端'),
    (2, 1, '经理'),
    (3, 2, '销售');

-- 员工表
INSERT INTO
    Staff
VALUES
    (
        0,
        0,
        '张三',
        1,
        '2000-01-01',
        '000000000000000000',
        '2020-01-01',
        '2020-05-01',
        '正式员工',
        '社会招聘',
        '其他',
        '汉',
        '重庆市南岸区',
        '15000000000',
        '1234567@qq.com',
        190,
        'A型',
        '未婚',
        '重庆市南岸区崇文路1号',
        '重庆市南岸区崇文路1号',
        '本科',
        '学士',
        '重庆邮电大学',
        '计算机科学与技术',
        '2020-06-30'
    ),
    (
        1,
        1,
        '李四',
        1,
        '2000-01-02',
        '000000000000000001',
        '2020-01-02',
        '2020-05-02',
        '临时员工',
        '校园招聘',
        '党员',
        '汉',
        '重庆市南岸区',
        '15000000001',
        '1234566@qq.com',
        180,
        'B型',
        '已婚',
        '重庆市南岸区崇文路2号',
        '重庆市南岸区崇文路2号',
        '大专',
        '硕士',
        '重庆邮电大学',
        '计算机科学与技术',
        '2020-05-30'
    ),
    (
        2,
        2,
        '王五',
        0,
        '2000-01-03',
        '000000000000000002',
        '2020-01-03',
        '2020-05-03',
        '正式员工',
        '校园招聘',
        '团员',
        '汉',
        '重庆市南岸区',
        '15000000002',
        '1234565@qq.com',
        170,
        ')型',
        '离婚',
        '重庆市南岸区崇文路3号',
        '重庆市南岸区崇文路3号',
        '本科',
        '博士',
        '重庆邮电大学',
        '计算机科学与技术',
        '2020-04-30'
    ),
    (
        3,
        3,
        '赵六',
        0,
        '2000-01-04',
        '000000000000000003',
        '2020-01-04',
        '2020-05-04',
        '正式员工',
        '社会招聘',
        '其他',
        '汉',
        '重庆市南岸区',
        '15000000003',
        '1234564@qq.com',
        160,
        'A型',
        '丧偶',
        '重庆市南岸区崇文路4号',
        '重庆市南岸区崇文路4号',
        '大专',
        '学士',
        '重庆邮电大学',
        '计算机科学与技术',
        '2020-03-30'
    );

-- 员工离职表
INSERT INTO
    Dimission
VALUES
    (0, 0, '2020-10-10', '辞退', '腾讯', '离职备注');

-- 岗位调动记录表
INSERT INTO
    PostTransfer
VALUES
    (
        0,
        1,
        '安卓',
        '前端',
        '升职',
        '人员调动',
        '备注',
        '2020-10-10'
    );

-- 部门调动表
INSERT INTO
    DepartTransfer
VALUES
    (
        0,
        3,
        '研发',
        '市场',
        '主动调动',
        '人员调动',
        '备注',
        '2020-10-10'
    );